Revit 2027 API
ParameterTypeId.AnalyticalModelStartAlignmentMethod Property
 "Start Alignment Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelStartAlignmentMethod { get; }
Public Shared ReadOnly Property AnalyticalModelStartAlignmentMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelStartAlignmentMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelStartAlignmentMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace